#下面这个接口的数据被放弃，该接口是推荐接口的包，数据重复率过于大，实际数据转换率特别低，因此放弃
# 职业代码库，自己去抓包看看有哪些去
# 纯手敲，好累噢，应该有简便的方法来着，但是我现在不想动脑子了，一步一步手敲着玩吧，累死了
#感觉前面学的抓包方法爬虫都要忘了，好饿哟
types = {
    # 销售大类
    "3000": "A0N7%2CA0MP%2C3004%2C3009%2C3005%2C3002%2C3016%2C3015%2C4009%2C3013%2C3017%2C3006%2C0829",  # 销售人员
    "3100": "3012%2C3105%2C3111%2C3106%2C3102%2C3109%2C4122%2C4608",  # 客服
    "3200": "A0LK%2CA0L6%2C5902%2C3213%2CA0ML%2C6104%2C6006",  # 销售行政及商务
    "8900": "A0MU%2C4113%2CA0MV%2C4120%2C4126%2CA0MW%2C1329",  # 医疗销售
    "2A00": "6010%2C6001",  # 房地产销售
    "A0JX": "5105%2C4924%2C0310%2C5001%2C5014%2C5115%2C5116%2C5117%2C5123%2C6920%2CA0M5%2C3011",  # 服务业销售
    "2C00": "8101%2C8102%2C8104",  # 教培销售
    "1E00": "5903%2CA0MO",  # 汽车销售
    "2B00": "3315%2C3326%2C3317%2CA0MO",  # 金融销售
    "1D00": "8401%2C8402",  # 销售支持
    # 互联网技术大类
    "0100": "A0JQ%2C0121%2CA0JR%2C0153%2C0126%2C0124%2C0120%2C0154%2C0143%2C0130%2C0133%2C0155%2CA0JS%2C0128",  # 后端开发
    "7900": "A0LA%2CA0L9%2C7915%2C7920%2CA0LB%2C7905%2C7902%2C7906%2C0149%2C7904%2C7903%2C0150",  # 运维技术支持
    "2600": "A0LB%2CA0JV%2C2610",  # 技术管理
    "2700": "A0JT%2C2707%2C2957%2C2718%2CA0KG%2C2722%2C2720%2C2719%2C7821%2C2816%2CA0JV",  # 测试
    "7300": "7309%2CA0NB%2CA0NC%2CA0ND%2C7307%2C7301%2C7302%2C7120%2C7308%2CA0NF%2CA0NG%2C7306%2CA0NH",  # 人工智能
    "A0JW": "A0JU%2C7701%2C7702%2C7811%2C7823%2C7810%2C7809%2CA0N6",  # 前端移动开发
    "7500": "0131%2C7501%2CA0NE%2C7503%2C7506%2C7508%2C7504%2C7512%2C7507%2C7505",  # 数据
    "8400": "8401%2C8402",  # 销售技术支持
    # 中介大类
    "0600": "0611%2CA0N3%2C0626%2C0610%2C0629%2C0608%2C0628%2C0635",  # 人力资源
    "2300": "2303%2CA0K9%2C2305%2C2306%2C2304%2C2310",  # 行政后勤
    #财务税务法务
    "0400": "0445%2CA0KF%2C0407%2C0446%2C0409%2C0450",  #财务
    "2D00": "0460%2C0405%2C2D01%2C2D02%2C2D03%2C0448%2CA0KE",  #会计
    "1100": "1114%2C1108%2C1107",  #法务
    "2E00": "0419%2C0412",  #审计
    "1F00": "1F02%2C2209%2C2229%2C4612",  #合规
    #运营大类
    "8000": "8053%2C8047%2CA0LC%2CA0LD%2C8041%2C8044%2C8057%2C7814%2C8042",  #业务运营
    "9000": "6102%2C6112%2C6109%2C6101%2C6105%2C8051",  #电商运营
    "9100": "A0LE%2C8059%2C8058%2C8052",  #内容运营
    "9300": "9301%2C9303%2C9302",  #线下运营
    #市场公关
    "0300": "0304%2C0330%2C0337%2C0324%2C0305%2C0339%2C0338%2C0340%2CA0K8",  #市场营销
    "4200": "4217%2C4219%2C4207%2C4209%2C4214%2C4213%2C4212",  #广告
    "4300": "4303%2C4121%2C4313%2C4314%2C4309%2C4306%2C4312",  #公关
    #设计
    "7413": "7413%2C0927",  #平面设计
    "7400": "7412%2C7402%2C7403%2C7416%2C7419%2C7401%2C7404%2C6617",  #互联网设计
    "0900": "0919%2C0940%2C0927%2C0934%2CA0MK%2C0925",  #工业设计
    "9500": "7422%2C7417%2C7418%2C7407",  #动画设计
    "4217": "4217",  #广告设计
    "9700": "A0LL%2C6917%2C0941%2C6902%2C6905%2C6914%2C6904%2C6913%2C6909%2C0934%2CA0MK",  #建筑室内设计
    "9800": "7819%2C7806%2C7817%2C7820%2C7818%2C7807%2C7808%2C7822",  #游戏设计
    "1A00": "3801%2C3813%2C3802",  #服装设计
    #产品
    "6600": "6602%2C6601%2C6603%2CA0JS%2C6608%2C6617",  #互联网产品经理
    "8600": "8604%2CA0LI%2C8602%2C8603",  #硬件产品经理
    "8700": "3312%2C8701%2C8702%2C8703%2C2954%2C2813",  #其他产品经理
    "8500": "7801%2C8501",  #游戏策划
    #项目经理管理
    "A0L5": "0584%2C7905%2C7101%2C2106%2C2821%2C2610%2C3504",  #
    #这里暂时排除了生产制造，下辖的所有小类我简单看了一眼不是很要技术工种，跟我所需要的数据有点差别，后续论文写完了想完善一下的话就再回来写
    #通信电子
    "2900": "A0L8%2CA0MZ%2CA0MY%2C2908%2C2911%2C2920%2C2918%2C2951%2C2964%2C2965%2C2962%2C2952%2CA0N2%2C2959%2C2954%2C2921%2C2906%2C2925%2C2970%2C2971%2C2969",  #电子电器仪器仪表
    "6700": "6701%2C6712%2C6723%2C6739%2C6761%2C6728%2C6746%2CA0MX%2CA0LG%2CA0LF%2CA0LI%2C6740%2CA0LH%2CA0LJ%2C6733%2C6741%2C6737%2C6727%2C6735%2C6747",  #半导体芯片
    "3A00": "2956%2C2955%2C2957%2C2919",  #硬件开发
    "2800": "2801%2C2807%2C2821%2C2808%2C2816%2C2813%2C2820%2C2817%2C2803%2C2814%2C2805%2C2815%2C2802%2C2818%2C2819",  #通信技术开发与应用
    "3B00": "2821%2C2608%2C2610",  #技术项目管理
    #就先爬5w条数据吧，多了我也懒得写了，十个大类
    #实际第一次测试，出现了大量的重复数据，数据转换率太低了，后续考虑全部加进去，15日一早尝试第一次正式爬取
}

keywords = [
#第一次爬取开始位置
    #销售
        "销售专员","客服专员","商务专员","渠道专员","客户经理","销售代表","电话销售","电商销售","售后专员","大客户专员",
    #互联网
        "软件工程师","数据分析","大数据开发","算法工程师","前端开发","后端开发","测试工程师","运维工程师","产品经理","信息安全",
    #人事
        "人事专员","HRBP","招聘专员 / 助理","培训专员 / 助理 / 培训师","薪资福利专员 / 助理","绩效考核专员 / 助理","行政专员 / 助理","文员","行政前台",
        "经理助理 / 秘书",
    #电商
        "运营专员","用户运营","数据运营","产品运营","活动运营","新媒体运营","电商专员","国内电商运营","跨境电商运营","内容审核",
    #财务
        "财务专员","出纳","会计师","总账会计","税务专员 / 助理","审计专员 / 助理","财务分析员","法务专员 / 助理","风险控制","合规专员",
    #电子
        "硬件工程师","电气工程师","电子工程师","嵌入式软件开发",
#第二次爬取开始位置
        "自动控制工程师","半导体工艺工程师","集成电路 IC 设计","硬件测试工程师","FAE 现场应用工程师","PCB 工程师",
    #设计
        "平面设计师","UI 设计师","视觉设计师","交互设计师","用户体验 (UE/UX) 设计师","美工 / 电商设计师","工业设计 / 产品设计","动画 / 3D 设计","原画师","广告创意 / 设计专员",
    #机械制造
        "机械工程师","机械设计","工艺 / 制程工程师","机械结构工程师","机电工程师","工业工程师","模具工程师","材料工程师","CNC / 数控编程","机械设备工程师",
    #教育科研
        "讲师 / 助教","幼教","小学教师","高中教师","职业技术教师","家教","科研人员","课程顾问","留学顾问","班主任 / 辅导员",
    #金融
        "金融产品销售","理财顾问","风险控制","资产管理","信贷管理","银行柜员","保险经纪人 / 保险代理","资产评估 / 分析","信审核查","互联网金融",
#第三次爬取开始位置
    #传媒影视   
        "主播 / 主持人","带货主播","摄影师 / 摄像师","视频剪辑","后期制作","导演 / 编导","演员 / 群众演员","模特","编剧","直播场控",
    #化工能源环保
        "化工工程师","食品 / 饮料研发","环保工程师","环保检测","环境影响评价工程师","碳排放管理员","光伏系统工程师","电力工程师","水利 / 水电工程师","矿产勘探 / 地质勘测工程师",
    #汽车工程
        "汽车维修","二手车评估师","汽车 / 摩托车工程师","汽车设计工程师","新能源电池工程师","智能驾驶工程师","车联网工程师","汽车质量工程师","汽车装配工艺工程师","底盘工程师",
    #餐饮服务
        "送餐员","咖啡师","收银员","中餐厨师","西餐厨师","面点师","调饮师","茶艺师","餐饮店长 / 经理","食品安全管理师",
    #建筑物业
        "建筑工程管理 / 项目经理","结构 / 土木 / 土建工程师","工程造价 / 预结算","施工员","工程监理","市政工程师","测绘 / 测量","安全员","物业维修员","物业管理专员 / 助理",
#第四次爬取开始位置
    #医药医疗
        "医药代表","药品生产 / 质量管理","医药技术研发人员","医疗器械研发","医疗器械销售","医学检验","药剂师","内科医生","药物分析研究员","药品市场推广",
    #旅游酒店
        "旅游顾问","宴会管理","票务"
]

